// Formatting string for metres
"%@ m"							= "%@ m";

// Undo actions
"Reverse Winding"				= "Reverse Winding";
"Recalculate Normals"			= "Recalculate Normals";
"Triangulate"					= "Triangulate";
"Recentre"						= "Recentre";
"Flip X"						= "Flip X";
"Flip Y"						= "Flip Y";
"Flip Z"						= "Flip Z";
"Scale"							= "Scale";
"Coalesce Vertices"				= "Coalesce Vertices";

// Toolbar items
"Show Inspector"				= "Show Inspector";
"Hide Wireframe"				= "Hide Wireframe";
"Show Wireframe"				= "Show Wireframe";
"Hide Faces"					= "Hide Faces";
"Show Faces"					= "Show Faces";
"Hide Normals"					= "Hide Normals";
"Show Normals"					= "Show Normals";
"Compare..."					= "Compare…";

// Mesh loader errors
"Out of memory." = "Out of memory.";
"Mesh \"%@\" contains faces with fewer than three vertices. These will be ignored." = "Mesh “%@” contains faces with fewer than three vertices. These will be ignored.";
"Mesh loader %@ for \"%@\" failed to start a material before committing geometry. This is an internal error, please report it." = "Mesh loader %@ for “%@” failed to start a material before committing geometry. This is an internal error, please report it.";
"Could not load mesh file \"%@\"." = "Could not load mesh file “%@”.";
"Failed to parse mesh \"%@\" - could not read %@ value." = "Failed to parse mesh “%@” – could not read %@ value.";
"Failed to allocate memory to load mesh \"%@\" with %u vertices and %u faces." = "Failed to allocate memory to load mesh “%@” with %u vertices and %u faces.";
"Failed to parse mesh \"%@\" - %@ section not found where expected." = "Failed to parse mesh “%@” – %@ section not found where expected.";
"Failed to parse mesh \"%@\" - could not read vertex %u." = "Failed to parse mesh “%@” – could not read vertex %u.";
"Failed to parse mesh \"%@\" - could not read smoothing group for face %u." = "Failed to parse mesh “%@” – could not read smoothing group for face %u.";
"Failed to parse mesh \"%@\" - could not read reserved attributes for face %u." = "Failed to parse mesh “%@” – could not read reserved attributes for face %u.";
"Failed to parse mesh \"%@\" - could not read normal for face %u." = "Failed to parse mesh “%@” – could not read normal for face %u.";
"Failed to parse mesh \"%@\" - could not read vertex count for face %u." = "Failed to parse mesh “%@” – could not read vertex count for face %u.";
"Failed to parse mesh \"%@\" - could not read vertex index %u for face %u." = "Failed to parse mesh “%@” – could not read vertex index %u for face %u.";
"Mesh \"%@\" has no TEXTURES section, using placeholder material." = @"Mesh “%@” has no TEXTURES section. A placeholder material will be used instead.";
"Failed to parse mesh \"%@\" - could not read material key for face %u." = "Failed to parse mesh “%@” – could not read material key for face %u.";
"Failed to parse mesh \"%@\" - could not read texture scale for face %u." = "Failed to parse mesh “%@” – could not read texture scale for face %u.";
"Failed to parse mesh \"%@\" - could not read texture coordinates for vertex %u of face %u." = "Failed to parse mesh “%@” – could not read texture coordinates for vertex %u of face %u.";
"Face %u of mesh \"%@\" has %u vertices, but no more than %u are supported." = "Face %u of mesh “%@” has %u vertices, but no more than %u are supported.";
"Failed to load mesh \"%@\" - encountered unexpected exception (%@: %@)." = "Failed to load mesh “%@” – encountered unexpected exception (%@: %@).";


// Material loader errors.
"The texture \"%@\" could not be loaded." = "The texture “%@” could not be loaded.";
